// Primitive →  String, Number, Boolean, Null, Undefined
// Non-Primitive →  Object, Array, Function


// why primitive/non-Primitive ?


// জাভাস্ক্রিপ্টে ডেটা টাইপগুলোকে কেন Primitive এবং Non-Primitive এই দুটি ভাগে ভাগ করা হয়েছে, তার মূল কারণ হলো ডেটাগুলো মেমরিতে কীভাবে জমা থাকে এবং তাদের আচরণ কেমন।


//TODO: ১. Primitive (মৌলিক বা আদিম)
// এদের Primitive বলা হয় কারণ এগুলো হলো জাভাস্ক্রিপ্টের সবচেয়ে সাধারণ বা মৌলিক ডেটা। এদের আর ছোট কোনো ভাগে ভাগ করা যায় না।

// অপরিবর্তনশীল (Immutable): একবার একটি প্রিমিটিভ ভ্যালু তৈরি করলে তা পরিবর্তন করা যায় না। আপনি ভেরিয়েবলের মান পরিবর্তন করতে পারেন, কিন্তু আগের মানটি মেমরিতে বদলে যায় না, বরং নতুন একটি মান তৈরি হয়।

// সরাসরি মান জমা রাখা: প্রিমিটিভ ডেটাগুলো মেমরির Stack (স্ট্যাক) নামক জায়গায় সরাসরি তাদের মান (Value) জমা রাখে।

// উদাহরণ: String, Number, Boolean, Null, Undefined ইত্যাদি।

//TODO: ২. Non-Primitive (যৌগিক বা রেফারেন্স টাইপ)
// এদের Non-Primitive বা Reference Type বলা হয় কারণ এগুলো প্রিমিটিভ ডেটা দিয়ে তৈরি এক একটি জটিল কাঠামো (Structure)।

// পরিবর্তনশীল (Mutable): এই ডেটা টাইপগুলোর ভেতরের মান আপনি চাইলে পরিবর্তন করতে পারেন (যেমন: একটি অবজেক্টের প্রপার্টি বা এরের এলিমেন্ট পাল্টানো)।

// রেফারেন্স জমা রাখা: এরা সরাসরি মান মেমরিতে রাখে না। আসল ডেটা জমা থাকে মেমরির Heap (হিপ) নামক বড় জায়গায়, আর ভেরিয়েবলটি কেবল সেই জায়গার একটি ঠিকানা বা Reference (লিঙ্ক) ধরে রাখে।

// উদাহরণ: Object, Array, Function ইত্যাদি।